In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from ydata_profiling import ProfileReport

In [2]:
df = pd.read_csv("titanic.csv")
df

,Survived,Pclass,Name,Sex,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
0,0.0,3.0,Mr. Owen Harris Braund,male,NaN,1,0.0,7.2500
1,1.0,1.0,Mrs. John Bradley (Florence Briggs Thayer) Cum...,female,38.0,1,0.0,71.2833
2,1.0,3.0,Miss. Laina Heikkinen,female,26.0,0,0.0,7.9250
3,1.0,1.0,Mrs. Jacques Heath (Lily May Peel) Futrelle,female,35.0,1,0.0,53.1000
4,0.0,3.0,Mr. William Henry Allen,male,35.0,0,0.0,8.0500
...,...,...,...,...,...,...,...,...
884,0.0,2.0,Rev. Juozas Montvila,male,27.0,0,0.0,13.0000
885,1.0,1.0,Miss. Margaret Edith Graham,female,19.0,0,NaN,30.0000
886,0.0,3.0,Miss. Catherine Helen Johnston,female,7.0,1,2.0,2.4500
887,1.0,1.0,Mr. Karl Howell Behr,male,26.0,0,0.0,30.0000
888,0.0,3.0,Mr. Patrick Dooley,male,32.0,0,0.0,7.7500

In [3]:
df_missing = pd.DataFrame(df.isna().sum().reset_index())
df_missing['total'] = len(df)
df_missing = df_missing.rename(columns = {'index' : 'column', 0 : 'missing'})
df_missing['percentage'] = df_missing['missing'] / df_missing['total'] * 100
df_missing

                    column  missing  total  percentage
0                 Survived        1    889    0.112486
1                   Pclass        3    889    0.337458
2                     Name        1    889    0.112486
3                      Sex        3    889    0.337458
4                      Age        3    889    0.337458
5  Siblings/Spouses Aboard        0    889    0.000000
6  Parents/Children Aboard        5    889    0.562430
7                     Fare        4    889    0.449944

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 8 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Survived                 888 non-null    float64
 1   Pclass                   886 non-null    float64
 2   Name                     888 non-null    object
 3   Sex                      886 non-null    object
 4   Age                      886 non-null    float64
 5   Siblings/Spouses Aboard  889 non-null    int64
 6   Parents/Children Aboard  884 non-null    float64
 7   Fare                     885 non-null    float64
dtypes: float64(5), int64(1), object(2)
memory usage: 55.7+ KB

In [ ]:
df.describe()
#survived is either 0 or 1 (int, float)
#pcclass is 1, 2 or 3 (int, float)
#Name has no criteria
#Sex should be male or female as str
#Age is between 0 and 100 (int, float)
#Siblings/Spouses Aboard is between 0 and 8 (int), lets make it 15
#Parents/Children Aboard is between 0 and 13 (int), lets make it 15
#Fare is from 0 to 870 pounds (according to internet) lets make it 5000

,Survived,Pclass,Age,Siblings/Spouses Aboard,Parents/Children Aboard,Fare
count,888.000000,886.000000,886.000000,889.000000,884.000000,885.000000
mean,0.397523,2.362302,29.447144,0.525309,0.394796,210.290046
std,0.591822,1.489967,14.137959,1.103680,1.207384,5126.766054
min,-1.000000,0.000000,0.000000,0.000000,-20.000000,-20.525000
25%,0.000000,2.000000,20.000000,0.000000,0.000000,7.895800
50%,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,10.000000,33.000000,80.000000,8.000000,13.000000,152458.000000

In [ ]:
#df = pd.read_csv('titanic.csv')
profile = ProfileReport(df, title = 'Titanic report')
profile.to_file('./titanic-profile_13122025.html')

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

In [ ]:
#c) Describe the possible errors you found in each column and how you could fix them (if possible, no need to fix them)

#Rows with missing values and duplicate rows would have to be eliminated

#Survived has 5 different values, only two are valid. I would list all values and replace them manually to a valid option,
# unless value is completely unrelated, then drop row completely

#pcclass has same issue than survived, so procedure is the same

#Name is irrelevant

#Sex is same as survived

#age would have to be an integer between 0 and ~100. Floats would be rounded to full integer

#Siblings and parents/children are similar. I would list all existing values and replace typos with corresponding integers. 

#fare has to be positive and within specified limits. I would drop rows with inconsistent data, 
# or replace them with fare price according to pcclass